# Problems:

1. Load the CSV into a Pandas DataFrame.

    Display the first 3 rows and summary statistics.

2. Using NumPy, create an array of all marks and compute:

    Mean, median, and standard deviation.

3. Display all students with marks greater than 80.

4. Add a new column "Result" → “Pass” if Marks ≥ 75 else “Fail”.

5. Add a new column "Eligible_for_interview" → "Yes" if Age >=20 else "No". 

6. Find how many students are from each city.

7. Change all city names to uppercase using Pandas string operations.

8. Sort the students by Marks in descending order.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("basic_data.csv")
df.head(3)

    Name  Age  Marks       City
0  Arjun   20     85      Delhi
1   Neha   22     90     Mumbai
2   Ravi   19     76  Bangalore

In [3]:
arr = df['Marks'].to_numpy()
print(arr)

[85 90 76 92 70 88]

In [4]:
df['Result'] = np.where(df['Marks'] >= 75, 'Pass', 'Fail')
df.head()

     Name  Age  Marks       City Result
0   Arjun   20     85      Delhi   Pass
1    Neha   22     90     Mumbai   Pass
2    Ravi   19     76  Bangalore   Pass
3  Simran   21     92      Delhi   Pass
4   Kabir   20     70    Chennai   Fail

In [5]:
df['Eligible_for_interview'] = np.where(df['Age'] >= 20, 'Yes', 'No')
df.head()

     Name  Age  Marks       City Result Eligible_for_interview
0   Arjun   20     85      Delhi   Pass                    Yes
1    Neha   22     90     Mumbai   Pass                    Yes
2    Ravi   19     76  Bangalore   Pass                     No
3  Simran   21     92      Delhi   Pass                    Yes
4   Kabir   20     70    Chennai   Fail                    Yes

In [6]:
df2=df
df2.to_csv("updated_data.csv", index=False)

In [7]:
df2.groupby("City")["Name"].count()

City
Bangalore    1
Chennai      1
Delhi        2
Kolkata      1
Mumbai       1
Name: Name, dtype: int64

In [8]:
df2["City"].str.upper()

0        DELHI
1       MUMBAI
2    BANGALORE
3        DELHI
4      CHENNAI
5      KOLKATA
Name: City, dtype: object

In [9]:
df2.sort_values("Marks", ascending=False)

     Name  Age  Marks       City Result Eligible_for_interview
3  Simran   21     92      Delhi   Pass                    Yes
1    Neha   22     90     Mumbai   Pass                    Yes
5  Ananya   23     88    Kolkata   Pass                    Yes
0   Arjun   20     85      Delhi   Pass                    Yes
2    Ravi   19     76  Bangalore   Pass                     No
4   Kabir   20     70    Chennai   Fail                    Yes